/*
<test_scores 拡張版>
+------+--------+---------+------+---------+
| id   | name   | english | math | science |
+------+--------+---------+------+---------+
|    1 | Yu     | 98      | 97   | 65      |
|    2 | Ai     | 96      | 80   | 76      |
|    3 | Ken    | 90      | 67   | 78      |
|    4 |        | 67      | 89   | 90      |
|    5 | Ishida | 78      | 98   | NULL    |
+------+--------+---------+------+---------+
*/
-- ORDER BYでデータを昇順にソート
SELECT * FROM test_scores ORDER BY english;
-- 結果
/*
+------+--------+---------+------+---------+
| id   | name   | english | math | science |
+------+--------+---------+------+---------+
|    4 |        | 67      | 89   | 90      |
|    5 | Ishida | 78      | 98   | NULL    |
|    3 | Ken    | 90      | 67   | 78      |
|    2 | Ai     | 96      | 80   | 76      |
|    1 | Yu     | 98      | 97   | 65      |
+------+--------+---------+------+---------+
5 rows in set (0.03 sec)
*/

-- DESCを末尾に付けて降順にソート
SELECT * FROM test_scores ORDER BY english DESC;
-- 結果
/*
+------+--------+---------+------+---------+
| id   | name   | english | math | science |
+------+--------+---------+------+---------+
|    1 | Yu     | 98      | 97   | 65      |
|    2 | Ai     | 96      | 80   | 76      |
|    3 | Ken    | 90      | 67   | 78      |
|    5 | Ishida | 78      | 98   | NULL    |
|    4 |        | 67      | 89   | 90      |
+------+--------+---------+------+---------+
5 rows in set (0.00 sec)
*/

/*
<test_scores 拡張版>
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    1 | Yu      | 98      | 97   | 65      |
|    2 | Ai      | 96      | 80   | 76      |
|    3 | Ken     | 90      | 67   | 78      |
|    4 |         | 67      | 89   | 90      |
|    5 | Ishida  | 78      | 98   | NULL    |
|    6 | Miyoshi | 96      | 84   | 53      |
+------+---------+---------+------+---------+
※適当なデータを入力した
*/

-- まずenglishで降順にソート、値が同じである場合にmathで昇順にソート
SELECT * FROM test_scores ORDER BY english DESC, math;
-- 結果
/*
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    1 | Yu      | 98      | 97   | 65      |
|    2 | Ai      | 96      | 80   | 76      |
|    6 | Miyoshi | 96      | 84   | 53      |
|    3 | Ken     | 90      | 67   | 78      |
|    5 | Ishida  | 78      | 98   | NULL    |
|    4 |         | 67      | 89   | 90      |
+------+---------+---------+------+---------+
6 rows in set (0.01 sec)
*/

-- WHEREを用いて条件を満たすデータだけ取り出した後に、ORDER BYでソートを行う
SELECT * FROM test_scores WHERE math BETWEEN 80 AND 90 ORDER BY english;
-- 結果
/*
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    4 |         | 67      | 89   | 90      |
|    2 | Ai      | 96      | 80   | 76      |
|    6 | Miyoshi | 96      | 84   | 53      |
+------+---------+---------+------+---------+
3 rows in set (0.01 sec)
*/

-- FIELD関数を用いると指定した値の順番にソートを行う。FIELD(カラム名,値, , ,)の形式で書く
SELECT * FROM test_scores ORDER BY FIELD(math,80,67,98);
-- 結果
/*
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    1 | Yu      | 98      | 97   | 65      |
|    4 |         | 67      | 89   | 90      |
|    6 | Miyoshi | 96      | 84   | 53      |
|    2 | Ai      | 96      | 80   | 76      |
|    3 | Ken     | 90      | 67   | 78      |
|    5 | Ishida  | 78      | 98   | NULL    |
+------+---------+---------+------+---------+
6 rows in set (0.01 sec)
*/

-- ORDER BYの後の値に条件を加えると、条件を満たす値のみソートの対象となる
SELECT * FROM test_scores ORDER BY math >= 90;
-- 結果
/*
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    2 | Ai      | 96      | 80   | 76      |
|    3 | Ken     | 90      | 67   | 78      |
|    4 |         | 67      | 89   | 90      |
|    6 | Miyoshi | 96      | 84   | 53      |
|    1 | Yu      | 98      | 97   | 65      |
|    5 | Ishida  | 78      | 98   | NULL    |
+------+---------+---------+------+---------+
6 rows in set (0.00 sec)
*/
