/*
<test_scores 拡張版>
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    1 | Yu      | 98      | 97   | 65      |
|    2 | Ai      | 96      | 80   | 76      |
|    3 | Ken     | 90      | 67   | 78      |
|    4 |         | 67      | 89   | 90      |
|    5 | Ishida  | 78      | 98   | NULL    |
|    6 | Miyoshi | 96      | 84   | 53      |
+------+---------+---------+------+---------+
*/

-- 末尾にLIMIT句を付けることで取得するデータの数を制限
SELECT * FROM test_scores LIMIT 2;
-- 結果
/*
+------+------+---------+------+---------+
| id   | name | english | math | science |
+------+------+---------+------+---------+
|    1 | Yu   | 98      | 97   | 65      |
|    2 | Ai   | 96      | 80   | 76      |
+------+------+---------+------+---------+
2 rows in set (0.01 sec)
*/

-- 末尾にLIMIT句とOFFSET句を付けることで、起点の位置から数えて、取得するデータの数を制限
SELECT * FROM test_scores LIMIT 3 OFFSET 2;
-- 結果
/*
+------+--------+---------+------+---------+
| id   | name   | english | math | science |
+------+--------+---------+------+---------+
|    3 | Ken    | 90      | 67   | 78      |
|    4 |        | 67      | 89   | 90      |
|    5 | Ishida | 78      | 98   | NULL    |
+------+--------+---------+------+---------+
3 rows in set (0.00 sec)
*/

-- ORDER BYによるソートの結果に対して、LIMIT句を適用
SELECT * FROM test_scores ORDER BY science LIMIT 4;
-- 結果
/*
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    5 | Ishida  | 78      | 98   | NULL    |
|    6 | Miyoshi | 96      | 84   | 53      |
|    1 | Yu      | 98      | 97   | 65      |
|    2 | Ai      | 96      | 80   | 76      |
+------+---------+---------+------+---------+
4 rows in set (0.01 sec)
*/
