/*
<test_scores 拡張版>
+------+---------+---------+------+---------+
| id   | name    | english | math | science |
+------+---------+---------+------+---------+
|    1 | Yu      | 98      | 97   | 65      |
|    2 | Ai      | 96      | 80   | 76      |
|    3 | Ken     | 90      | 67   | 78      |
|    4 |         | 67      | 89   | 90      |
|    5 | Ishida  | 78      | 98   | NULL    |
|    6 | Miyoshi | 96      | 84   | 53      |
+------+---------+---------+------+---------+
*/

-- englishで同じ値を持つデータをまとめて表示
-- SELECTで指定するデータとグループ化の対象のデータは同じでないとエラーが発生する
SELECT english FROM test_scores GROUP BY english;
-- 結果
/*
+---------+
| english |
+---------+
| 67      |
| 78      |
| 90      |
| 96      |
| 98      |
+---------+
5 rows in set (0.01 sec)
/*

-- COUNT関数（後に学習する）を用いて、データの重複の数を調べる
SELECT english, COUNT(*) FROM test_scores GROUP BY english;
-- 結果
/*
+---------+----------+
| english | COUNT(*) |
+---------+----------+
| 67      |        1 |
| 78      |        1 |
| 90      |        1 |
| 96      |        2 |
| 98      |        1 |
+---------+----------+
5 rows in set (0.01 sec)
*/

-- MAX関数（後に学習する）を用いて、あるカラムの値が重複したデータにおける、他のカラムの最大値を調べる
SELECT english, MAX(math) FROM test_scores GROUP BY english;
/*
+---------+-----------+
| english | MAX(math) |
+---------+-----------+
| 67      | 89        |
| 78      | 98        |
| 90      | 67        |
| 96      | 84        |
| 98      | 97        |
+---------+-----------+
5 rows in set (0.01 sec)
*/
