/*
<test_scores 拡張版>
+------+--------+---------+------+---------+
| id   | name   | english | math | science |
+------+--------+---------+------+---------+
|    1 | Yu     | 98      | 97   | 65      |
|    2 | Ai     | 96      | 80   | 76      |
|    3 | Ken    | 90      | 67   | 78      |
|    4 |        | 67      | 89   | 90      |
|    5 | Ishida | 78      | 98   | NULL    |
+------+--------+---------+------+---------+
*/
-- 6か90をscienceカラムの値に含むデータを取り出す
SELECT * FROM test_scores WHERE science IN (6,90);
-- 結果
/*
+------+------+---------+------+---------+
| id   | name | english | math | science |
+------+------+---------+------+---------+
|    4 |      | 67      | 89   | 90      |
+------+------+---------+------+---------+
1 row in set (0.01 sec)
*/

-- 78と90のどちらもscienceカラムの値に含まないデータを取り出す
SELECT * FROM test_scores WHERE science NOT IN (78,90);
-- 結果
/*
+------+------+---------+------+---------+
| id   | name | english | math | science |
+------+------+---------+------+---------+
|    1 | Yu   | 98      | 97   | 65      |
|    2 | Ai   | 96      | 80   | 76      |
+------+------+---------+------+---------+
2 rows in set (0.01 sec)
*/

-- IN句の中にSELECT句を用いることができる。この場合はenglishカラムの値をscienceカラムに含むデータを取り出している
SELECT * FROM test_scores WHERE science IN (SELECT english FROM test_scores);
-- 結果
/*
+------+------+---------+------+---------+
| id   | name | english | math | science |
+------+------+---------+------+---------+
|    3 | Ken  | 90      | 67   | 78      |
|    4 |      | 67      | 89   | 90      |
+------+------+---------+------+---------+
2 rows in set (0.00 sec)
*/
